# 照合用の学生証データ辞書
# 実際には、学籍番号と対応するIDmのデータを事前に準備しておく必要があります。
# フォーマット： { 'IDmの16進数文字列': '対応する学籍番号' }
#学籍番号と内部IDのデータベース

studentsID = {
            "012E50E6E84C626D":"2323010",
            "012E50E6E84C625D":"2323011",
            "012E50E6E84B303E":"2323019",
            "012E50E6E84B3139":"2323022",
            "012E50E6E84D498D":"2323033",
            "012E50E6E84D4DB7":"2323049",
            "012E50E6E84D4E38":"2323051",
            "012E5CE5D81676A4":"2323082",
            "012E50E6E84CC072":"2323087",
            "012E50E6E84CC073":"2323088",
            "012E50E6E84CC053":"2323091",
            "012E50E6E84CBD8C":"2323093",
            "012E50E6E84CBE71":"2323107"
            }